{"clean_prefix": "The suspect sent the file recently was safe. Was the suspect safe?", "patch_prefix": "The suspect sent the file that was safe. Was the suspect safe?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The politician handed the bill recently was gone. Was the politician gone?", "patch_prefix": "The politician handed the bill that was gone. Was the politician gone?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The woman brought the mail recently was bad. Was the woman bad?", "patch_prefix": "The woman brought the mail that was bad. Was the woman bad?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The boy fed the chicken recently was good. Was the boy good?", "patch_prefix": "The boy fed the chicken that was good. Was the boy good?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The doctor offered the operation recently was fine. Was the doctor fine?", "patch_prefix": "The doctor offered the operation that was fine. Was the doctor fine?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The professor awarded the grant recently was fine. Was the professor fine?", "patch_prefix": "The professor awarded the grant that was fine. Was the professor fine?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The technician refused the service recently was interesting. Was the technician interesting?", "patch_prefix": "The technician refused the service that was interesting. Was the technician interesting?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The mechanic brought the truck recently was safe. Was the mechanic safe?", "patch_prefix": "The mechanic brought the truck that was safe. Was the mechanic safe?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The guitarist assigned the song recently was bad. Was the guitarist bad?", "patch_prefix": "The guitarist assigned the song that was bad. Was the guitarist bad?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The player paid the bonus recently was safe. Was the player safe?", "patch_prefix": "The player paid the bonus that was safe. Was the player safe?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The employee offered the job recently was interesting. Was the employee interesting?", "patch_prefix": "The employee offered the job that was interesting. Was the employee interesting?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The manager assigned the training recently was fine. Was the manager fine?", "patch_prefix": "The manager assigned the training that was fine. Was the manager fine?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The mayor sent the document recently was bad. Was the mayor bad?", "patch_prefix": "The mayor sent the document that was bad. Was the mayor bad?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The player handed the contract recently was fine. Was the player fine?", "patch_prefix": "The player handed the contract that was fine. Was the player fine?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The engineer brought the equipment recently was fine. Was the engineer fine?", "patch_prefix": "The engineer brought the equipment that was fine. Was the engineer fine?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The girl fed the lamb recently was interesting. Was the girl interesting?", "patch_prefix": "The girl fed the lamb that was interesting. Was the girl interesting?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The instructor offered the position recently was fine. Was the instructor fine?", "patch_prefix": "The instructor offered the position that was fine. Was the instructor fine?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The governor awarded the contract recently was safe. Was the governor safe?", "patch_prefix": "The governor awarded the contract that was safe. Was the governor safe?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The patient refused the treatment recently was safe. Was the patient safe?", "patch_prefix": "The patient refused the treatment that was safe. Was the patient safe?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The operator brought the machine recently was interesting. Was the operator interesting?", "patch_prefix": "The operator brought the machine that was interesting. Was the operator interesting?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The dancer assigned the ballet recently was good. Was the dancer good?", "patch_prefix": "The dancer assigned the ballet that was good. Was the dancer good?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The participant paid the money recently was gone. Was the participant gone?", "patch_prefix": "The participant paid the money that was gone. Was the participant gone?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The chef offered the restaurant recently was bad. Was the chef bad?", "patch_prefix": "The chef offered the restaurant that was bad. Was the chef bad?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The cook assigned the oven recently was safe. Was the cook safe?", "patch_prefix": "The cook assigned the oven that was safe. Was the cook safe?", "clean_answer": " Yes", "patch_answer": " No"}
