{"clean_prefix": "The suspect sent the file that was safe. Did the suspect send the file?", "patch_prefix": "The suspect sent the file recently was safe. Did the suspect send the file?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The politician handed the bill that was gone. Did the politician hand the bill?", "patch_prefix": "The politician handed the bill recently was gone. Did the politician hand the bill?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The woman brought the mail that was bad. Did the woman bring the mail?", "patch_prefix": "The woman brought the mail recently was bad. Did the woman bring the mail?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The boy fed the chicken that was good. Did the boy feed the chicken?", "patch_prefix": "The boy fed the chicken recently was good. Did the boy feed the chicken?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The doctor offered the operation that was fine. Did the doctor offer the operation?", "patch_prefix": "The doctor offered the operation recently was fine. Did the doctor offer the operation?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The professor awarded the grant that was fine. Did the professor award the grant?", "patch_prefix": "The professor awarded the grant recently was fine. Did the professor award the grant?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The technician refused the service that was interesting. Did the technician refuse the service?", "patch_prefix": "The technician refused the service recently was interesting. Did the technician refuse the service?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The mechanic brought the truck that was safe. Did the mechanic bring the truck?", "patch_prefix": "The mechanic brought the truck recently was safe. Did the mechanic bring the truck?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The guitarist assigned the song that was bad. Did the guitarist assign the song?", "patch_prefix": "The guitarist assigned the song recently was bad. Did the guitarist assign the song?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The player paid the bonus that was safe. Did the player pay the bonus?", "patch_prefix": "The player paid the bonus recently was safe. Did the player pay the bonus?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The employee offered the job that was interesting. Did the employee offer the job?", "patch_prefix": "The employee offered the job recently was interesting. Did the employee offer the job?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The manager assigned the training that was fine. Did the manager assign the training?", "patch_prefix": "The manager assigned the training recently was fine. Did the manager assign the training?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The mayor sent the document that was bad. Did the mayor send the document?", "patch_prefix": "The mayor sent the document recently was bad. Did the mayor send the document?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The player handed the contract that was fine. Did the player hand the contract?", "patch_prefix": "The player handed the contract recently was fine. Did the player hand the contract?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The engineer brought the equipment that was fine. Did the engineer bring the equipment?", "patch_prefix": "The engineer brought the equipment recently was fine. Did the engineer bring the equipment?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The girl fed the lamb that was interesting. Did the girl feed the lamb?", "patch_prefix": "The girl fed the lamb recently was interesting. Did the girl feed the lamb?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The instructor offered the position that was fine. Did the instructor offer the position?", "patch_prefix": "The instructor offered the position recently was fine. Did the instructor offer the position?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The governor awarded the contract that was safe. Did the governor award the contract?", "patch_prefix": "The governor awarded the contract recently was safe. Did the governor award the contract?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The patient refused the treatment that was safe. Did the patient refuse the treatment?", "patch_prefix": "The patient refused the treatment recently was safe. Did the patient refuse the treatment?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The operator brought the machine that was interesting. Did the operator bring the machine?", "patch_prefix": "The operator brought the machine recently was interesting. Did the operator bring the machine?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The dancer assigned the ballet that was good. Did the dancer assign the ballet?", "patch_prefix": "The dancer assigned the ballet recently was good. Did the dancer assign the ballet?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The participant paid the money that was gone. Did the participant pay the money?", "patch_prefix": "The participant paid the money recently was gone. Did the participant pay the money?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The chef offered the restaurant that was bad. Did the chef offer the restaurant?", "patch_prefix": "The chef offered the restaurant recently was bad. Did the chef offer the restaurant?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The cook assigned the oven that was safe. Did the cook assign the oven?", "patch_prefix": "The cook assigned the oven recently was safe. Did the cook assign the oven?", "clean_answer": " Yes", "patch_answer": " No"}
