{"clean_prefix": "The suspect who was sent the file deserved further investigation given the new evidence. Did the suspect deserve further investigation given the new evidence?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The corrupt politician who was handed the bill received unwelcome attention from southern voters. Did the corrupt politician receive unwelcome attention from southern voters?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The woman who was brought the mail disappeared mysteriously after reading the bad news in it. Did the woman disappear mysteriously after reading the bad news in it?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The boy who was fed the chicken stayed surprisingly happy despite having a mild allergic reaction. Did the boy stay surprisingly happy despite having a mild allergic reaction?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The new doctor who was offered the operation appeared increasingly likely to succeed in her career. Did the new doctor appear increasingly likely to succeed in her career?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The professor who was awarded the grant gained more attention from marine biologists. Did the professor gain more attention from marine biologists?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The technician who was refused the service stopped working almost immediately after the argument. Did the technician stop working almost immediately after the argument?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The mechanic who was brought the truck needed several more hours to fully repair it. Did the mechanic need several more hours to fully repair it?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The guitarist who was assigned the song failed dramatically because he never practiced enough. Did the guitarist fail dramatically because he never practiced enough?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The player who was paid the bonus remained essentially the same despite his sudden fame and wealth. Did the player remain essentially the same despite his sudden fame and wealth?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The recent hire who was offered the job prepared many students for careers in media. Did the recent hire prepare many students for careers in media?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The assistant manager who was assigned the training seemed unnecessarily demanding to new staff. Did the assistant manager seem unnecessarily demanding to new staff?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The mayor who was sent the document provided sufficient evidence that it was simply blackmail. Did the mayor provide sufficient evidence that it was simply blackmail?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The basketball player who was handed the contract created another controversy in the NBA. Did the basketball player create another controversy in the NBA?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The engineer who was brought the equipment required constant supervision from senior technicians. Did the engineer require constant supervision from senior technicians?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The little girl who was fed the lamb remained relatively calm despite having asked for beef. Did the little girl remain relatively calm despite having asked for beef?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The yoga instructor who was offered the position demanded immense physical effort from everyone. Did the yoga instructor demand immense physical effort from everyone?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The governor who was awarded the contract received sweeping support across the entire state. Did the governor receive sweeping support across the entire state?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The patient who was refused the treatment continued causing uncomfortable scenes in the ER. Did the patient continue causing uncomfortable scenes in the ER?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The operator who was brought the machine started working efficiently with the added automation. Did the operator start working efficiently with the added automation?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The dancer who was assigned the ballet achieved incredible success for a new performer. Did the dancer achieve incredible success for a new performer?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The contestant who was paid the money became unavailable and suddenly terminated his contract. Did the contestant become unavailable and suddenly terminate his contract?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The new chef who was offered the restaurant separated mediocre cooks from gifted ones. Did the new chef separate mediocre cooks from gifted ones?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The apprentice baker who was assigned the oven produced smaller cakes because he lacked experience. Did the apprentice baker produce smaller cakes because he lacked experience?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
