{"clean_prefix": "The suspect showed that the file deserved further investigation during the murder trial. Did the file deserve further investigation during the murder trial?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The corrupt politician mentioned that the bill received unwelcome attention from southern voters. Did the bill receive unwelcome attention from southern voters?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The woman maintained that the mail disappeared mysteriously from her front porch. Did the mail disappear mysteriously from her front porch?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The boy found that the chicken stayed surprisingly happy in the new barn. Did the chicken stay surprisingly happy in the new barn?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The new doctor demonstrated that the operation appeared increasingly likely to succeed. Did the operation appear increasingly likely to succeed?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The professor noticed that the grant gained more attention from marine biologists. Did the grant gain more attention from marine biologists?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The technician reported that the service stopped working almost immediately after the storm started. Did the service stop working almost immediately after the storm started?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The mechanic observed that the truck needed several more hours to be repaired. Did the truck need several more hours to be repaired?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The guitarist knew that the song failed dramatically because of the tensions within the band. Did the song fail dramatically because of the tensions within the band?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The player revealed that the bonus remained essentially the same as in the original contract. Did the bonus remain essentially the same as in the original contract?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The recent hire claimed that the job prepared many students for careers in media. Did the job prepare many students for careers in media?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The assistant manager discovered that the training seemed unnecessarily demanding for new staff. Did the training seem unnecessarily demanding for new staff?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The mayor showed that the document provided sufficient evidence to prove her innocence. Did the document provide sufficient evidence to prove her innocence?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The basketball player mentioned that the contract created another controversy in the NBA. Did the contract create another controversy in the NBA?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The engineer maintained that the equipment required constant supervision from senior technicians. Did the equipment require constant supervision from senior technicians?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The little girl found that the lamb remained relatively calm despite the absence of its mother. Did the lamb remain relatively calm despite the absence of its mother?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The yoga instructor demonstrated that the position demanded immense physical effort from everyone. Did the position demand immense physical effort from everyone?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The governor noticed that the contract received sweeping support across the entire state. Did the contract receive sweeping support across the entire state?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The patient reported that the treatment continued causing uncomfortable side effects like nausea. Did the treatment continue causing uncomfortable side effects like nausea?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The operator observed that the machine started working efficiently all of a sudden. Did the machine start working efficiently all of a sudden?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The dancer knew that the ballet achieved incredible success for a small local production. Did the ballet achieve incredible success for a small local production?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The contestant revealed that the money became unavailable to him when the show's budget shrank. Did the money become unavailable to him when the show's budget shrank?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The new chef claimed that the restaurant separated mediocre cooks from gifted ones. Did the restaurant separate mediocre cooks from gifted ones?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The apprentice baker discovered that the oven produced smaller cakes because it heated too fast. Did the oven produce smaller cakes because it heated too fast?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
