{"clean_prefix": "The suspect showed the file deserved further investigation during the murder trial. Did the suspect show the file?", "patch_prefix": "", "clean_answer": " No", "patch_answer": " Yes"}
{"clean_prefix": "The corrupt politician mentioned the bill received unwelcome attention from southern voters. Did the corrupt politician mention the bill?", "patch_prefix": "", "clean_answer": " No", "patch_answer": " Yes"}
{"clean_prefix": "The woman maintained the mail disappeared mysteriously from her front porch. Did the woman maintain the mail?", "patch_prefix": "", "clean_answer": " No", "patch_answer": " Yes"}
{"clean_prefix": "The boy found the chicken stayed surprisingly happy in the new barn. Did the boy find the chicken?", "patch_prefix": "", "clean_answer": " No", "patch_answer": " Yes"}
{"clean_prefix": "The new doctor demonstrated the operation appeared increasingly likely to succeed. Did the new doctor demonstrate the operation?", "patch_prefix": "", "clean_answer": " No", "patch_answer": " Yes"}
{"clean_prefix": "The professor noticed the grant gained more attention from marine biologists. Did the professor notice the grant?", "patch_prefix": "", "clean_answer": " No", "patch_answer": " Yes"}
{"clean_prefix": "The technician reported the service stopped working almost immediately after the storm started. Did the technician report the service?", "patch_prefix": "", "clean_answer": " No", "patch_answer": " Yes"}
{"clean_prefix": "The mechanic observed the truck needed several more hours to be repaired. Did the mechanic observe the truck?", "patch_prefix": "", "clean_answer": " No", "patch_answer": " Yes"}
{"clean_prefix": "The guitarist knew the song failed dramatically because of the tensions within the band. Did the guitarist know the song?", "patch_prefix": "", "clean_answer": " No", "patch_answer": " Yes"}
{"clean_prefix": "The player revealed the bonus remained essentially the same as in the original contract. Did the player reveal the bonus?", "patch_prefix": "", "clean_answer": " No", "patch_answer": " Yes"}
{"clean_prefix": "The recent hire claimed the job prepared many students for careers in media. Did the recent hire claim the job?", "patch_prefix": "", "clean_answer": " No", "patch_answer": " Yes"}
{"clean_prefix": "The assistant manager discovered the training seemed unnecessarily demanding for new staff. Did the assistant manager discover the training?", "patch_prefix": "", "clean_answer": " No", "patch_answer": " Yes"}
{"clean_prefix": "The mayor showed the document provided sufficient evidence to prove her innocence. Did the mayor show the document?", "patch_prefix": "", "clean_answer": " No", "patch_answer": " Yes"}
{"clean_prefix": "The basketball player mentioned the contract created another controversy in the NBA. Did the basketball player mention the contract?", "patch_prefix": "", "clean_answer": " No", "patch_answer": " Yes"}
{"clean_prefix": "The engineer maintained the equipment required constant supervision from senior technicians. Did the engineer maintain the equipment?", "patch_prefix": "", "clean_answer": " No", "patch_answer": " Yes"}
{"clean_prefix": "The little girl found the lamb remained relatively calm despite the absence of its mother. Did the little girl find the lamb?", "patch_prefix": "", "clean_answer": " No", "patch_answer": " Yes"}
{"clean_prefix": "The yoga instructor demonstrated the position demanded immense physical effort from everyone. Did the yoga instructor demonstrate the position?", "patch_prefix": "", "clean_answer": " No", "patch_answer": " Yes"}
{"clean_prefix": "The governor noticed the contract received sweeping support across the entire state. Did the governor notice the contract?", "patch_prefix": "", "clean_answer": " No", "patch_answer": " Yes"}
{"clean_prefix": "The patient reported the treatment continued causing uncomfortable side effects like nausea. Did the patient report the treatment?", "patch_prefix": "", "clean_answer": " No", "patch_answer": " Yes"}
{"clean_prefix": "The operator observed the machine started working efficiently all of a sudden. Did the operator observe the machine?", "patch_prefix": "", "clean_answer": " No", "patch_answer": " Yes"}
{"clean_prefix": "The dancer knew the ballet achieved incredible success for a small local production. Did the dancer know the ballet?", "patch_prefix": "", "clean_answer": " No", "patch_answer": " Yes"}
{"clean_prefix": "The contestant revealed the money became unavailable to him when the show's budget shrank. Did the contestant reveal the money?", "patch_prefix": "", "clean_answer": " No", "patch_answer": " Yes"}
{"clean_prefix": "The new chef claimed the restaurant separated mediocre cooks from gifted ones. Did the new chef claim the restaurant?", "patch_prefix": "", "clean_answer": " No", "patch_answer": " Yes"}
{"clean_prefix": "The apprentice baker discovered the oven produced smaller cakes because it heated too fast. Did the apprentice baker discover the oven?", "patch_prefix": "", "clean_answer": " No", "patch_answer": " Yes"}
