{"clean_prefix": "The suspect showed the file actually was bad. Was the file bad?", "patch_prefix": "The suspect showed the file that was bad. Was the file bad?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The politician mentioned the bill actually was good. Was the bill good?", "patch_prefix": "The politician mentioned the bill that was good. Was the bill good?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The woman maintained the mail actually was interesting. Was the mail interesting?", "patch_prefix": "The woman maintained the mail that was interesting. Was the mail interesting?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The boy found the chicken actually was interesting. Was the chicken interesting?", "patch_prefix": "The boy found the chicken that was interesting. Was the chicken interesting?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The doctor demonstrated the operation actually was safe. Was the operation safe?", "patch_prefix": "The doctor demonstrated the operation that was safe. Was the operation safe?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The professor noticed the grant actually was good. Was the grant good?", "patch_prefix": "The professor noticed the grant that was good. Was the grant good?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The technician reported the service actually was interesting. Was the service interesting?", "patch_prefix": "The technician reported the service that was interesting. Was the service interesting?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The mechanic observed the truck actually was bad. Was the truck bad?", "patch_prefix": "The mechanic observed the truck that was bad. Was the truck bad?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The guitarist knew the song actually was safe. Was the song safe?", "patch_prefix": "The guitarist knew the song that was safe. Was the song safe?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The player revealed the bonus actually was good. Was the bonus good?", "patch_prefix": "The player revealed the bonus that was good. Was the bonus good?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The employee claimed the job actually was bad. Was the job bad?", "patch_prefix": "The employee claimed the job that was bad. Was the job bad?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The manager discovered the training actually was good. Was the training good?", "patch_prefix": "The manager discovered the training that was good. Was the training good?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The mayor showed the document actually was bad. Was the document bad?", "patch_prefix": "The mayor showed the document that was bad. Was the document bad?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The player mentioned the contract actually was fine. Was the contract fine?", "patch_prefix": "The player mentioned the contract that was fine. Was the contract fine?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The engineer maintained the equipment actually was bad. Was the equipment bad?", "patch_prefix": "The engineer maintained the equipment that was bad. Was the equipment bad?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The girl found the lamb actually was safe. Was the lamb safe?", "patch_prefix": "The girl found the lamb that was safe. Was the lamb safe?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The instructor demonstrated the position actually was gone. Was the position gone?", "patch_prefix": "The instructor demonstrated the position that was gone. Was the position gone?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The governor noticed the contract actually was bad. Was the contract bad?", "patch_prefix": "The governor noticed the contract that was bad. Was the contract bad?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The patient reported the treatment actually was fine. Was the treatment fine?", "patch_prefix": "The patient reported the treatment that was fine. Was the treatment fine?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The operator observed the machine actually was safe. Was the machine safe?", "patch_prefix": "The operator observed the machine that was safe. Was the machine safe?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The dancer knew the ballet actually was bad. Was the ballet bad?", "patch_prefix": "The dancer knew the ballet that was bad. Was the ballet bad?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The participant revealed the money actually was fine. Was the money fine?", "patch_prefix": "The participant revealed the money that was fine. Was the money fine?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The chef claimed the restaurant actually was good. Was the restaurant good?", "patch_prefix": "The chef claimed the restaurant that was good. Was the restaurant good?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "The cook discovered the oven actually was gone. Was the oven gone?", "patch_prefix": "The cook discovered the oven that was gone. Was the oven gone?", "clean_answer": " Yes", "patch_answer": " No"}
