{"clean_prefix": "Because the suspect changed the file deserved further investigation during the jury discussions. Did the suspect change the file?", "patch_prefix": "", "clean_answer": " No", "patch_answer": " Yes"}
{"clean_prefix": "After the corrupt politician signed the bill received unwelcome attention from southern voters. Did the corrupt politician sign the bill?", "patch_prefix": "", "clean_answer": " No", "patch_answer": " Yes"}
{"clean_prefix": "After the woman moved the mail disappeared mysteriously from the delivery system. Did the woman move the mail?", "patch_prefix": "", "clean_answer": " No", "patch_answer": " Yes"}
{"clean_prefix": "Although the boy attacked the chicken stayed surprisingly happy as if nothing happened. Did the boy attack the chicken?", "patch_prefix": "", "clean_answer": " No", "patch_answer": " Yes"}
{"clean_prefix": "After the new doctor left the operation appeared increasingly likely to succeed. Did the new doctor leave the operation?", "patch_prefix": "", "clean_answer": " No", "patch_answer": " Yes"}
{"clean_prefix": "After the professor read the grant gained more attention due to her excellent description. Did the professor read the grant?", "patch_prefix": "", "clean_answer": " No", "patch_answer": " Yes"}
{"clean_prefix": "After the technician called the service stopped working almost immediately to his surprise. Did the technician call the service?", "patch_prefix": "", "clean_answer": " No", "patch_answer": " Yes"}
{"clean_prefix": "Because the mechanic stopped the truck needed several more hours before it could be fully repaired. Did the mechanic stop the truck?", "patch_prefix": "", "clean_answer": " No", "patch_answer": " Yes"}
{"clean_prefix": "After the guitarist began the song failed dramatically because he skipped the sound check. Did the guitarist begin the song?", "patch_prefix": "", "clean_answer": " No", "patch_answer": " Yes"}
{"clean_prefix": "Although the player lost the bonus remained essentially the same as in the original contract. Did the player lose the bonus?", "patch_prefix": "", "clean_answer": " No", "patch_answer": " Yes"}
{"clean_prefix": "Once the recent hire started the job prepared many students for careers in media. Did the recent hire start the job?", "patch_prefix": "", "clean_answer": " No", "patch_answer": " Yes"}
{"clean_prefix": "While the assistant manager worked the training seemed unnecessarily demanding to him. Did the assistant manager work the training?", "patch_prefix": "", "clean_answer": " No", "patch_answer": " Yes"}
{"clean_prefix": "Although the mayor changed the document provided sufficient evidence for what he had promised. Did the mayor change the document?", "patch_prefix": "", "clean_answer": " No", "patch_answer": " Yes"}
{"clean_prefix": "After the basketball player signed the contract created another controversy in the NBA. Did the basketball player sign the contract?", "patch_prefix": "", "clean_answer": " No", "patch_answer": " Yes"}
{"clean_prefix": "After the engineer moved the equipment required constant supervision from senior technicians. Did the engineer move the equipment?", "patch_prefix": "", "clean_answer": " No", "patch_answer": " Yes"}
{"clean_prefix": "When the little girl attacked the lamb remained relatively calm despite the sudden assault. Did the little girl attack the lamb?", "patch_prefix": "", "clean_answer": " No", "patch_answer": " Yes"}
{"clean_prefix": "Before the yoga instructor left the position demanded immense physical effort from everyone. Did the yoga instructor leave the position?", "patch_prefix": "", "clean_answer": " No", "patch_answer": " Yes"}
{"clean_prefix": "While the governor read the contract received sweeping support from the audience at the rally. Did the governor read the contract?", "patch_prefix": "", "clean_answer": " No", "patch_answer": " Yes"}
{"clean_prefix": "Before the patient called the treatment continued causing uncomfortable side effects like nausea. Did the patient call the treatment?", "patch_prefix": "", "clean_answer": " No", "patch_answer": " Yes"}
{"clean_prefix": "Once the operator stopped the machine started working efficiently without any supervision. Did the operator stop the machine?", "patch_prefix": "", "clean_answer": " No", "patch_answer": " Yes"}
{"clean_prefix": "Once the dancer began the ballet achieved incredible success for a show with a new performer. Did the dancer begin the ballet?", "patch_prefix": "", "clean_answer": " No", "patch_answer": " Yes"}
{"clean_prefix": "After the contestant lost the money became unavailable despite his previous three wins in a row. Did the contestant lose the money?", "patch_prefix": "", "clean_answer": " No", "patch_answer": " Yes"}
{"clean_prefix": "Once the new chef started the restaurant separated mediocre cooks from gifted ones. Did the new chef start the restaurant?", "patch_prefix": "", "clean_answer": " No", "patch_answer": " Yes"}
{"clean_prefix": "When the apprentice baker worked the oven produced smaller cakes because he lacked experience. Did the apprentice baker work the oven?", "patch_prefix": "", "clean_answer": " No", "patch_answer": " Yes"}
