{"clean_prefix": "Because the suspect changed the file turned out quite gone. Was the file gone?", "patch_prefix": "Because the suspect changed the file, it was gone. Was the file gone?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "After the politician signed the bill turned out quite interesting. Was the bill interesting?", "patch_prefix": "After the politician signed the bill, it was interesting. Was the bill interesting?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "After the woman moved the mail turned out quite bad. Was the mail bad?", "patch_prefix": "After the woman moved the mail, it was bad. Was the mail bad?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "Although the boy attacked the chicken turned out quite gone. Was the chicken gone?", "patch_prefix": "Although the boy attacked the chicken, it was gone. Was the chicken gone?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "After the doctor left the operation turned out quite bad. Was the operation bad?", "patch_prefix": "After the doctor left the operation, it was bad. Was the operation bad?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "After the professor read the grant turned out quite good. Was the grant good?", "patch_prefix": "After the professor read the grant, it was good. Was the grant good?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "After the technician called the service turned out quite interesting. Was the service interesting?", "patch_prefix": "After the technician called the service, it was interesting. Was the service interesting?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "Because the mechanic stopped the truck turned out quite fine. Was the truck fine?", "patch_prefix": "Because the mechanic stopped the truck, it was fine. Was the truck fine?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "After the guitarist began the song turned out quite safe. Was the song safe?", "patch_prefix": "After the guitarist began the song, it was safe. Was the song safe?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "Although the player lost the bonus turned out quite fine. Was the bonus fine?", "patch_prefix": "Although the player lost the bonus, it was fine. Was the bonus fine?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "Once the employee started the job turned out quite good. Was the job good?", "patch_prefix": "Once the employee started the job, it was good. Was the job good?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "While the manager worked the training turned out quite gone. Was the training gone?", "patch_prefix": "While the manager worked the training, it was gone. Was the training gone?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "Although the mayor changed the document turned out quite good. Was the document good?", "patch_prefix": "Although the mayor changed the document, it was good. Was the document good?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "After the player signed the contract turned out quite interesting. Was the contract interesting?", "patch_prefix": "After the player signed the contract, it was interesting. Was the contract interesting?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "After the engineer moved the equipment turned out quite gone. Was the equipment gone?", "patch_prefix": "After the engineer moved the equipment, it was gone. Was the equipment gone?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "When the girl attacked the lamb turned out quite safe. Was the lamb safe?", "patch_prefix": "When the girl attacked the lamb, it was safe. Was the lamb safe?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "Before the instructor left the position turned out quite bad. Was the position bad?", "patch_prefix": "Before the instructor left the position, it was bad. Was the position bad?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "While the governor read the contract turned out quite gone. Was the contract gone?", "patch_prefix": "While the governor read the contract, it was gone. Was the contract gone?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "Before the patient called the treatment turned out quite bad. Was the treatment bad?", "patch_prefix": "Before the patient called the treatment, it was bad. Was the treatment bad?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "Once the operator stopped the machine turned out quite good. Was the machine good?", "patch_prefix": "Once the operator stopped the machine, it was good. Was the machine good?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "Once the dancer began the ballet turned out quite safe. Was the ballet safe?", "patch_prefix": "Once the dancer began the ballet, it was safe. Was the ballet safe?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "After the participant lost the money turned out quite bad. Was the money bad?", "patch_prefix": "After the participant lost the money, it was bad. Was the money bad?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "Once the chef started the restaurant turned out quite safe. Was the restaurant safe?", "patch_prefix": "Once the chef started the restaurant, it was safe. Was the restaurant safe?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "When the cook worked the oven turned out quite fine. Was the oven fine?", "patch_prefix": "When the cook worked the oven, it was fine. Was the oven fine?", "clean_answer": " Yes", "patch_answer": " No"}
