{"clean_prefix": "Because the suspect changed the file, it was gone. Did the suspect change the file?", "patch_prefix": "Because the suspect changed the file turned out quite gone. Did the suspect change the file?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "After the politician signed the bill, it was interesting. Did the politician sign the bill?", "patch_prefix": "After the politician signed the bill turned out quite interesting. Did the politician sign the bill?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "After the woman moved the mail, it was bad. Did the woman move the mail?", "patch_prefix": "After the woman moved the mail turned out quite bad. Did the woman move the mail?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "Although the boy attacked the chicken, it was gone. Did the boy attack the chicken?", "patch_prefix": "Although the boy attacked the chicken turned out quite gone. Did the boy attack the chicken?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "After the doctor left the operation, it was bad. Did the doctor leave the operation?", "patch_prefix": "After the doctor left the operation turned out quite bad. Did the doctor leave the operation?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "After the professor read the grant, it was good. Did the professor read the grant?", "patch_prefix": "After the professor read the grant turned out quite good. Did the professor read the grant?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "After the technician called the service, it was interesting. Did the technician call the service?", "patch_prefix": "After the technician called the service turned out quite interesting. Did the technician call the service?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "Because the mechanic stopped the truck, it was fine. Did the mechanic stop the truck?", "patch_prefix": "Because the mechanic stopped the truck turned out quite fine. Did the mechanic stop the truck?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "After the guitarist began the song, it was safe. Did the guitarist begin the song?", "patch_prefix": "After the guitarist began the song turned out quite safe. Did the guitarist begin the song?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "Although the player lost the bonus, it was fine. Did the player lose the bonus?", "patch_prefix": "Although the player lost the bonus turned out quite fine. Did the player lose the bonus?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "Once the employee started the job, it was good. Did the employee start the job?", "patch_prefix": "Once the employee started the job turned out quite good. Did the employee start the job?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "While the manager worked the training, it was gone. Did the manager work the training?", "patch_prefix": "While the manager worked the training turned out quite gone. Did the manager work the training?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "Although the mayor changed the document, it was good. Did the mayor change the document?", "patch_prefix": "Although the mayor changed the document turned out quite good. Did the mayor change the document?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "After the player signed the contract, it was interesting. Did the player sign the contract?", "patch_prefix": "After the player signed the contract turned out quite interesting. Did the player sign the contract?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "After the engineer moved the equipment, it was gone. Did the engineer move the equipment?", "patch_prefix": "After the engineer moved the equipment turned out quite gone. Did the engineer move the equipment?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "When the girl attacked the lamb, it was safe. Did the girl attack the lamb?", "patch_prefix": "When the girl attacked the lamb turned out quite safe. Did the girl attack the lamb?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "Before the instructor left the position, it was bad. Did the instructor leave the position?", "patch_prefix": "Before the instructor left the position turned out quite bad. Did the instructor leave the position?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "While the governor read the contract, it was gone. Did the governor read the contract?", "patch_prefix": "While the governor read the contract turned out quite gone. Did the governor read the contract?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "Before the patient called the treatment, it was bad. Did the patient call the treatment?", "patch_prefix": "Before the patient called the treatment turned out quite bad. Did the patient call the treatment?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "Once the operator stopped the machine, it was good. Did the operator stop the machine?", "patch_prefix": "Once the operator stopped the machine turned out quite good. Did the operator stop the machine?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "Once the dancer began the ballet, it was safe. Did the dancer begin the ballet?", "patch_prefix": "Once the dancer began the ballet turned out quite safe. Did the dancer begin the ballet?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "After the participant lost the money, it was bad. Did the participant lose the money?", "patch_prefix": "After the participant lost the money turned out quite bad. Did the participant lose the money?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "Once the chef started the restaurant, it was safe. Did the chef start the restaurant?", "patch_prefix": "Once the chef started the restaurant turned out quite safe. Did the chef start the restaurant?", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "When the cook worked the oven, it was fine. Did the cook work the oven?", "patch_prefix": "When the cook worked the oven turned out quite fine. Did the cook work the oven?", "clean_answer": " Yes", "patch_answer": " No"}
