{"clean_prefix": "Because the suspect changed, the file deserved further investigation during the jury discussions. Did the file deserve further investigation during the jury discussions?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "After the corrupt politician signed, the bill received unwelcome attention from southern voters. Did the bill receive unwelcome attention from southern voters?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "After the woman moved, the mail disappeared mysteriously from the delivery system. Did the mail disappear mysteriously from the delivery system?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "Although the boy attacked, the chicken stayed surprisingly happy as if nothing happened. Did the chicken stay surprisingly happy as if nothing happened?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "After the new doctor left, the operation appeared increasingly likely to succeed. Did the operation appear increasingly likely to succeed?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "After the professor read, the grant gained more attention due to her excellent description. Did more attention due to her excellent description?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "After the technician called, the service stopped working almost immediately to his surprise. Did the service stop working almost immediately to his surprise?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "Because the mechanic stopped, the truck needed several more hours before it could be fully repaired. Did the truck need several more hours before it could be fully repaired?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "After the guitarist began, the song failed dramatically because he skipped the sound check. Did the song fail dramatically because he skipped the sound check?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "Although the player lost, the bonus remained essentially the same as in the original contract. Did the bonus remain essentially the same as in the original contract?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "Once the recent hire started, the job prepared many students for careers in media. Did the job prepare many students for careers in media?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "While the assistant manager worked, the training seemed unnecessarily demanding to him. Did the training seem unnecessarily demanding to him?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "Although the mayor changed, the document provided sufficient evidence for what he had promised. Did the document provide sufficient evidence for what he had promised?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "After the basketball player signed, the contract created another political controversy in the NBA. Did the contract create another political controversy in the NBA?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "After the engineer moved, the equipment required constant supervision from senior technicians. Did the equipment require constant supervision from senior technicians?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "When the little girl attacked, the lamb remained relatively calm despite the sudden assault. Did the lamb remain relatively calm despite the sudden assault?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "Before the yoga instructor left, the position demanded immense physical effort from everyone. Did the position demand immense physical effort from everyone?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "While the governor read, the contract received sweeping support from the audience at the rally. Did sweeping support from the audience at the rally?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "Before the patient called, the treatment continued causing uncomfortable side effects like nausea. Did the treatment continue causing uncomfortable side effects like nausea?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "Once the operator stopped, the machine started working efficiently without any supervision. Did the machine start working efficiently without any supervision?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "Once the dancer began, the ballet achieved incredible success for a show with a new performer. Did the ballet achieve incredible success for a show with a new performer?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "After the contestant lost, the money became unavailable despite his previous three wins in a row. Did the money become unavailable despite his previous three wins in a row?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "Once the new chef started, the restaurant separated mediocre cooks from gifted ones. Did the restaurant separate mediocre cooks from gifted ones?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
{"clean_prefix": "When the apprentice baker worked, the oven produced smaller cakes because he lacked experience. Did the oven produce smaller cakes because he lacked experience?", "patch_prefix": "", "clean_answer": " Yes", "patch_answer": " No"}
